export enum Currency {
  // Основные резервные валюты
  USD = 'USD', // Доллар США
  EUR = 'EUR', // Евро
  JPY = 'JPY', // Японская иена
  GBP = 'GBP', // Фунт стерлингов
  CHF = 'CHF', // Швейцарский франк
  CNY = 'CNY', // Китайский юань
  AUD = 'AUD', // Австралийский доллар
  CAD = 'CAD', // Канадский доллар

  // Азиатские валюты
  INR = 'INR', // Индийская рупия
  KRW = 'KRW', // Южнокорейская вона
  SGD = 'SGD', // Сингапурский доллар
  MYR = 'MYR', // Малайзийский ринггит
  THB = 'THB', // Тайский бат
  HKD = 'HKD', // Гонконгский доллар
  IDR = 'IDR', // Индонезийская рупия
  PHP = 'PHP', // Филиппинское песо
  VND = 'VND', // Вьетнамский донг

  // Европейские валюты
  NOK = 'NOK', // Норвежская крона
  SEK = 'SEK', // Шведская крона
  DKK = 'DKK', // Датская крона
  PLN = 'PLN', // Польский злотый
  CZK = 'CZK', // Чешская крона
  HUF = 'HUF', // Венгерский форинт
  RON = 'RON', // Румынский лей
  TRY = 'TRY', // Турецкая лира
  RUB = 'RUB', // Российский рубль

  // Ближний Восток и Африка
  ILS = 'ILS', // Израильский шекель
  AED = 'AED', // Дирхам ОАЭ
  SAR = 'SAR', // Саудовский риял
  ZAR = 'ZAR', // Южноафриканский рэнд
  EGP = 'EGP', // Египетский фунт

  // Латинская Америка
  MXN = 'MXN', // Мексиканское песо
  BRL = 'BRL', // Бразильский реал
  ARS = 'ARS', // Аргентинское песо
  CLP = 'CLP', // Чилийское песо
  COP = 'COP', // Колумбийское песо
  PEN = 'PEN', // Перуанский соль

  // Другие
  NZD = 'NZD', // Новозеландский доллар
  UAH = 'UAH', // Украинская гривна
  KZT = 'KZT', // Казахстанский тенге
  TWD = 'TWD', // Тайваньский доллар
  PKR = 'PKR', // Пакистанская рупия
  BGN = 'BGN', // Болгарский лев
  HRK = 'HRK', // Хорватская куна
  ISK = 'ISK'  // Исландская крона
}


// TODO: Добавление криптовалют
export enum CryptoCurrency {
  BTC = 'BTC',
  ETH = 'ETH',
  USDT = 'USDT',
  // ...
}
